<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>libuv基础 | libuv中文教程</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.5.2">
        <meta name="author" content="luohaha">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="../source/filesystem.html" />
    
    
    <link rel="prev" href="../source/introduction.html" />
    

        <script>window["gitbook-plugin-github-buttons"] = {"repo":"luohaha/Chinese-uvbook","types":["star"]};</script>
    </head>
    <body>
        
        
    <div class="book" data-level="2" data-chapter-title="libuv基础" data-filepath="source/basics_of_libuv.md" data-basepath=".." data-revision="Thu Nov 26 2015 15:09:22 GMT+0800 (CST)">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="../index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Introduction
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="source/introduction.html">
            
                
                    <a href="../source/introduction.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        简介
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="2" data-path="source/basics_of_libuv.html">
            
                
                    <a href="../source/basics_of_libuv.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        libuv基础
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="source/filesystem.html">
            
                
                    <a href="../source/filesystem.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        文件系统
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="source/networking.html">
            
                
                    <a href="../source/networking.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        网络
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="source/threads.html">
            
                
                    <a href="../source/threads.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        线程
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="source/processes.html">
            
                
                    <a href="../source/processes.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        进程
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="source/advanced-event-loops.html">
            
                
                    <a href="../source/advanced-event-loops.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        高级事件循环
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="source/utilities.html">
            
                
                    <a href="../source/utilities.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        实用工具
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="9" data-path="source/about.html">
            
                
                    <a href="../source/about.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>9.</b>
                        
                        关于
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../" >libuv中文教程</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="basics-of-libuv">Basics of libuv</h1>
<p>libuv&#x5F3A;&#x5236;&#x4F7F;&#x7528;&#x5F02;&#x6B65;&#x7684;&#xFF0C;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x3002;&#x5B83;&#x7684;&#x6838;&#x5FC3;&#x5DE5;&#x4F5C;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;event-loop&#xFF0C;&#x8FD8;&#x6709;&#x57FA;&#x4E8E;I/O&#x548C;&#x5176;&#x5B83;&#x4E8B;&#x4EF6;&#x901A;&#x77E5;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;libuv&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x6838;&#x5FC3;&#x5DE5;&#x5177;&#xFF0C;&#x4F8B;&#x5982;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x975E;&#x963B;&#x585E;&#x7684;&#x7F51;&#x7EDC;&#x652F;&#x6301;&#xFF0C;&#x5F02;&#x6B65;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8BBF;&#x95EE;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x7B49;&#x3002;  </p>
<h2 id="event-loops">Event loops</h2>
<p>&#x5728;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x4F1A;&#x5173;&#x6CE8;&#x6BCF;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x53D1;&#x751F;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#x3002;libuv&#x4F1A;&#x8D1F;&#x8D23;&#x5C06;&#x6765;&#x81EA;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4E8B;&#x4EF6;&#x6536;&#x96C6;&#x8D77;&#x6765;&#xFF0C;&#x6216;&#x8005;&#x76D1;&#x89C6;&#x5176;&#x4ED6;&#x6765;&#x6E90;&#x7684;&#x4E8B;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x7528;&#x6237;&#x5C31;&#x53EF;&#x4EE5;&#x6CE8;&#x518C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4F1A;&#x5728;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x8C03;&#x7528;&#x3002;event-loop&#x4F1A;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x3002;&#x7528;&#x4F2A;&#x4EE3;&#x7801;&#x63CF;&#x8FF0;&#x5982;&#x4E0B;&#xFF1A;  </p>
<pre><code class="lang-c"><span class="hljs-keyword">while</span> there are still events to process:
    e = get the next event
    <span class="hljs-keyword">if</span> there is a callback associated with e:
        call the callback
</code></pre>
<p>&#x4E3E;&#x51E0;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;  </p>
<blockquote>
<ul>
<li>&#x51C6;&#x5907;&#x597D;&#x88AB;&#x5199;&#x5165;&#x7684;&#x6587;&#x4EF6;&#x3002;  </li>
<li>&#x5305;&#x542B;&#x51C6;&#x5907;&#x88AB;&#x8BFB;&#x53D6;&#x7684;&#x6570;&#x636E;&#x7684;socket&#x3002;  </li>
<li>&#x8D85;&#x65F6;&#x7684;&#x5B9A;&#x65F6;&#x5668;&#x3002;  </li>
</ul>
</blockquote>
<p>event-loop&#x6700;&#x7EC8;&#x4F1A;&#x88AB;<code>uv_run()</code>&#x542F;&#x52A8;&#xFF0D;&#x5F53;&#x4F7F;&#x7528;libuv&#x65F6;&#xFF0C;&#x6700;&#x540E;&#x90FD;&#x4F1A;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x3002;  </p>
<p>&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x4E2D;&#x6700;&#x7ECF;&#x5E38;&#x5904;&#x7406;&#x7684;&#x4E00;&#x822C;&#x662F;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x5927;&#x5806;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#x3002;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x4F20;&#x7EDF;&#x7684;&#x8F93;&#x5165;&#xFF0F;&#x8F93;&#x51FA;&#x51FD;&#x6570;(&#x4F8B;&#x5982;<code>read</code>&#xFF0C;<code>fprintf</code>)&#x90FD;&#x662F;&#x963B;&#x585E;&#x5F0F;&#x7684;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5411;&#x6587;&#x4EF6;&#x5199;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x4ECE;&#x7F51;&#x7EDC;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x6240;&#x82B1;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5BF9;&#x6BD4;cpu&#x7684;&#x5904;&#x7406;&#x901F;&#x5EA6;&#x5DEE;&#x5F97;&#x592A;&#x591A;&#x3002;&#x4EFB;&#x52A1;&#x6CA1;&#x6709;&#x5B8C;&#x6210;&#xFF0C;&#x51FD;&#x6570;&#x662F;&#x4E0D;&#x4F1A;&#x8FD4;&#x56DE;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x4EC0;&#x4E48;&#x4E5F;&#x505A;&#x4E0D;&#x4E86;&#x3002;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x7684;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x969C;&#x788D;&#x3002;  </p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x4F7F;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x963B;&#x585E;&#x7684;I/O&#x64CD;&#x4F5C;&#x90FD;&#x4F1A;&#x88AB;&#x5206;&#x914D;&#x5230;&#x5404;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF08;&#x6216;&#x8005;&#x662F;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x6C60;&#xFF09;&#x3002;&#x5F53;&#x67D0;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E00;&#x65E6;&#x963B;&#x585E;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x8C03;&#x5EA6;&#x5904;&#x7406;&#x5176;&#x4ED6;&#x9700;&#x8981;cpu&#x8D44;&#x6E90;&#x7684;&#x7EBF;&#x7A0B;&#x3002;  </p>
<p>&#x4F46;&#x662F;libuv&#x4F7F;&#x7528;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5F02;&#x6B65;&#xFF0C;&#x975E;&#x963B;&#x585E;&#x3002;&#x5927;&#x591A;&#x6570;&#x7684;&#x73B0;&#x4EE3;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4E86;&#x57FA;&#x4E8E;&#x4E8B;&#x4EF6;&#x901A;&#x77E5;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x7684;socket&#x4E0A;&#x7684;<code>read</code>&#x8C03;&#x7528;&#x4F1A;&#x53D1;&#x751F;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x53D1;&#x9001;&#x65B9;&#x628A;&#x4FE1;&#x606F;&#x53D1;&#x9001;&#x8FC7;&#x6765;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8BF7;&#x6C42;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x76D1;&#x89C6;socket&#x4E8B;&#x4EF6;&#x7684;&#x5230;&#x6765;&#xFF0C;&#x5E76;&#x5C06;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x901A;&#x77E5;&#x653E;&#x5230;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C31;&#x53EF;&#x4EE5;&#x5F88;&#x7B80;&#x5355;&#x5730;&#x68C0;&#x67E5;&#x4E8B;&#x4EF6;&#x662F;&#x5426;&#x5230;&#x6765;&#xFF08;&#x53EF;&#x80FD;&#x6B64;&#x65F6;&#x6B63;&#x5728;&#x4F7F;&#x7528;cpu&#x505A;&#x6570;&#x503C;&#x5904;&#x7406;&#x7684;&#x8FD0;&#x7B97;&#xFF09;&#xFF0C;&#x5E76;&#x53CA;&#x65F6;&#x5730;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x3002;&#x8BF4;libuv&#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x5934;&#x8868;&#x8FBE;&#x5BF9;&#x67D0;&#x4E00;&#x4E8B;&#x4EF6;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x5E76;&#x5728;&#x53E6;&#x4E00;&#x5934;&#x83B7;&#x53D6;&#x5230;&#x6570;&#x636E;&#xFF08;&#x5BF9;&#x4E8E;&#x65F6;&#x95F4;&#x6216;&#x662F;&#x7A7A;&#x95F4;&#x6765;&#x8BF4;&#xFF09;&#x3002;&#x5B83;&#x662F;&#x975E;&#x963B;&#x585E;&#x662F;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E0;&#x9700;&#x5728;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x540E;&#x7B49;&#x5F85;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x505A;&#x5176;&#x4ED6;&#x7684;&#x4E8B;&#x3002;libuv&#x7684;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x65B9;&#x5F0F;&#x5F88;&#x597D;&#x5730;&#x4E0E;&#x8BE5;&#x6A21;&#x578B;&#x5339;&#x914D;, &#x56E0;&#x4E3A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E8B;&#x4EF6;&#x53EF;&#x4EE5;&#x89C6;&#x4E3A;&#x53E6;&#x5916;&#x4E00;&#x79CD;libuv&#x4E8B;&#x4EF6;. &#x975E;&#x963B;&#x585E;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x5728;&#x5176;&#x4ED6;&#x4E8B;&#x4EF6;&#x5230;&#x6765;&#x65F6;&#x88AB;&#x5C3D;&#x5FEB;&#x5904;&#x7406;&#xFF08;&#x5F53;&#x7136;&#x8FD8;&#x8981;&#x8003;&#x8651;&#x786C;&#x4EF6;&#x7684;&#x80FD;&#x529B;&#xFF09;&#x3002;  </p>
<h5 id="note">Note</h5>
<blockquote>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;I/O&#x5728;&#x540E;&#x53F0;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x786C;&#x4EF6;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x7EBF;&#x7A0B;&#x662F;&#x5904;&#x7406;&#x5668;&#x6700;&#x57FA;&#x672C;&#x7684;&#x6267;&#x884C;&#x5355;&#x5143;&#xFF0C;libuv&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x4F1A;&#x8FD0;&#x884C;&#x540E;&#x53F0;/&#x5DE5;&#x4F5C;&#x8005;&#x7EBF;&#x7A0B;, &#x6216;&#x8005;&#x91C7;&#x7528;&#x975E;&#x963B;&#x585E;&#x65B9;&#x5F0F;&#x6765;&#x8F6E;&#x6D41;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;  </p>
</blockquote>
<p>Bert Belder&#xFF0C;&#x4E00;&#x4E2A;libuv&#x7684;&#x6838;&#x5FC3;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x77ED;&#x89C6;&#x9891;&#x5411;&#x6211;&#x4EEC;&#x89E3;&#x91CA;&#x4E86;libuv&#x7684;&#x67B6;&#x6784;&#x548C;&#x5B83;&#x7684;&#x540E;&#x53F0;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E4B;&#x524D;&#x6CA1;&#x6709;&#x63A5;&#x89E6;&#x8FC7;&#x7C7B;&#x4F3C;libuv&#xFF0C;libev&#xFF0C;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4F1A;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x89C6;&#x9891;&#x7684;&#x7F51;&#x5740;&#x662F;<a href="https://youtu.be/nGn60vDSxQ4" target="_blank">https://youtu.be/nGn60vDSxQ4</a> &#x3002;</p>
<p>&#x5305;&#x542B;&#x4E86;libuv&#x7684;event-loop&#x7684;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x7684;<a href="http://docs.libuv.org/en/v1.x/design.html#the-i-o-loop" target="_blank">&#x6587;&#x6863;</a>&#x3002;  </p>
<h2 id="hello-world">HELLO WORLD</h2>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5199;&#x7B2C;&#x4E00;&#x4E2A;libuv&#x7A0B;&#x5E8F;&#x5427;&#xFF01;&#x5B83;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x505A;&#xFF0C;&#x53EA;&#x662F;&#x5F00;&#x542F;&#x4E86;&#x4E00;&#x4E2A;loop&#xFF0C;&#x7136;&#x540E;&#x5F88;&#x5FEB;&#x5730;&#x9000;&#x51FA;&#x4E86;&#x3002;  </p>
<h4 id="helloworldmainc">helloworld/main.c</h4>
<pre><code class="lang-c"><span class="hljs-preprocessor">#<span class="hljs-keyword">include</span> <span class="hljs-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-preprocessor">#<span class="hljs-keyword">include</span> <span class="hljs-string">&lt;stdlib.h&gt;</span></span>
<span class="hljs-preprocessor">#<span class="hljs-keyword">include</span> <span class="hljs-string">&lt;uv.h&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span> </span>{
    <span class="hljs-keyword">uv_loop_t</span> *loop = <span class="hljs-built_in">malloc</span>(<span class="hljs-keyword">sizeof</span>(<span class="hljs-keyword">uv_loop_t</span>));
    uv_loop_init(loop);

    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Now quitting.\n&quot;</span>);
    uv_run(loop, UV_RUN_DEFAULT);

    uv_loop_close(loop);
    <span class="hljs-built_in">free</span>(loop);
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4F1A;&#x5F88;&#x5FEB;&#x5C31;&#x9000;&#x51FA;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x53EF;&#x4EE5;&#x5F88;&#x5904;&#x7406;&#x7684;&#x4E8B;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5404;&#x79CD;API&#x51FD;&#x6570;&#x6765;&#x544A;&#x8BC9;event-loop&#x6211;&#x4EEC;&#x8981;&#x76D1;&#x89C6;&#x7684;&#x4E8B;&#x4EF6;&#x3002;  </p>
<p>&#x4ECE;libuv&#x7684;1.0&#x7248;&#x672C;&#x5F00;&#x59CB;&#xFF0C;&#x7528;&#x6237;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4F7F;&#x7528;<code>uv_loop_init</code>&#x521D;&#x59CB;&#x5316;loop&#x4E4B;&#x524D;&#xFF0C;&#x7ED9;&#x5176;&#x5206;&#x914D;&#x76F8;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x3002;&#x8FD9;&#x5C31;&#x5141;&#x8BB8;&#x4F60;&#x690D;&#x5165;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#x3002;&#x8BB0;&#x4F4F;&#x8981;&#x4F7F;&#x7528;<code>uv_loop_close(uv_loop_t *)</code>&#x5173;&#x95ED;loop&#xFF0C;&#x7136;&#x540E;&#x518D;&#x56DE;&#x6536;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;&#x5728;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x9000;&#x51FA;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5173;&#x95ED;loop&#xFF0C;&#x7CFB;&#x7EDF;&#x4E5F;&#x4F1A;&#x81EA;&#x52A8;&#x56DE;&#x6536;&#x5185;&#x5B58;&#x3002;&#x5BF9;&#x4E8E;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x5408;&#x7406;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x5F88;&#x91CD;&#x8981;&#x3002;   </p>
<h3 id="default-loop">Default loop</h3>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>uv_default_loop</code>&#x83B7;&#x53D6;libuv&#x63D0;&#x4F9B;&#x7684;&#x9ED8;&#x8BA4;loop&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;loop&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x3002;  </p>
<h5 id="note">Note</h5>
<blockquote>
<p>nodejs&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x9ED8;&#x8BA4;&#x7684;loop&#x4F5C;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4E3B;loop&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x7F16;&#x5199;nodejs&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x4E00;&#x4E0B;&#x3002;  </p>
</blockquote>
<h2 id="error-handling">Error handling</h2>
<p>&#x521D;&#x59CB;&#x5316;&#x51FD;&#x6570;&#x6216;&#x8005;&#x662F;&#x540C;&#x6B65;&#x6267;&#x884C;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F1A;&#x5728;&#x6267;&#x884C;&#x5931;&#x8D25;&#x540E;&#x8FD4;&#x56DE;&#x4EE3;&#x8868;&#x9519;&#x8BEF;&#x7684;&#x8D1F;&#x6570;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F1A;&#x5728;&#x6267;&#x884C;&#x5931;&#x8D25;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED9;&#x5B83;&#x4EEC;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x53C2;&#x6570;&#x3002;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;<code>UV_E</code><a href="http://docs.libuv.org/en/v1.x/errors.html#error-constants" target="_blank">&#x5E38;&#x91CF;</a>&#x3002;  </p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>uv_strerror(int)</code>&#x548C;<code>uv_err_name(int)</code>&#x5206;&#x522B;&#x83B7;&#x53D6;<code>const char *</code>&#x683C;&#x5F0F;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x548C;&#x9519;&#x8BEF;&#x540D;&#x5B57;&#x3002;  </p>
<p>I/O&#x51FD;&#x6570;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF08;&#x4F8B;&#x5982;&#x6587;&#x4EF6;&#x548C;socket&#x7B49;&#xFF09;&#x4F1A;&#x88AB;&#x4F20;&#x9012;&#x4E00;&#x4E2A;<code>nread</code>&#x53C2;&#x6570;&#x3002;&#x5982;&#x679C;<code>nread</code>&#x5C0F;&#x4E8E;0&#xFF0C;&#x5C31;&#x4EE3;&#x8868;&#x51FA;&#x73B0;&#x4E86;&#x9519;&#x8BEF;&#xFF08;&#x5F53;&#x7136;&#xFF0C;UV_EOF&#x662F;&#x8BFB;&#x53D6;&#x5230;&#x6587;&#x4EF6;&#x672B;&#x7AEF;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4F60;&#x8981;&#x7279;&#x6B8A;&#x5904;&#x7406;&#xFF09;&#x3002;  </p>
<h2 id="handles-and-requests">Handles and Requests</h2>
<p>libuv&#x7684;&#x5DE5;&#x4F5C;&#x5EFA;&#x7ACB;&#x5728;&#x7528;&#x6237;&#x8868;&#x8FBE;&#x5BF9;&#x7279;&#x5B9A;&#x4E8B;&#x4EF6;&#x7684;&#x5174;&#x8DA3;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x521B;&#x9020;&#x5BF9;&#x5E94;I/O&#x8BBE;&#x5907;&#xFF0C;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x8FDB;&#x7A0B;&#x7B49;&#x7684;handle&#x6765;&#x5B9E;&#x73B0;&#x3002;handle&#x662F;&#x4E0D;&#x900F;&#x660E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5176;&#x4E2D;&#x5BF9;&#x5E94;&#x7684;&#x7C7B;&#x578B;<code>uv_TYPE_t</code>&#x4E2D;&#x7684;type&#x6307;&#x5B9A;&#x4E86;handle&#x7684;&#x4F7F;&#x7528;&#x76EE;&#x7684;&#x3002;  </p>
<h4 id="libuv-watchers">libuv watchers</h4>
<pre><code class="lang-c"><span class="hljs-comment">/* Handle types. */</span>
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_loop_s <span class="hljs-keyword">uv_loop_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_handle_s <span class="hljs-keyword">uv_handle_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_stream_s <span class="hljs-keyword">uv_stream_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_tcp_s <span class="hljs-keyword">uv_tcp_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_udp_s <span class="hljs-keyword">uv_udp_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_pipe_s <span class="hljs-keyword">uv_pipe_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_tty_s <span class="hljs-keyword">uv_tty_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_poll_s <span class="hljs-keyword">uv_poll_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_timer_s <span class="hljs-keyword">uv_timer_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_prepare_s <span class="hljs-keyword">uv_prepare_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_check_s <span class="hljs-keyword">uv_check_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_idle_s <span class="hljs-keyword">uv_idle_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_async_s <span class="hljs-keyword">uv_async_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_process_s <span class="hljs-keyword">uv_process_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_fs_event_s <span class="hljs-keyword">uv_fs_event_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_fs_poll_s <span class="hljs-keyword">uv_fs_poll_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_signal_s <span class="hljs-keyword">uv_signal_t</span>;

<span class="hljs-comment">/* Request types. */</span>
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_req_s <span class="hljs-keyword">uv_req_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_getaddrinfo_s <span class="hljs-keyword">uv_getaddrinfo_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_getnameinfo_s <span class="hljs-keyword">uv_getnameinfo_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_shutdown_s <span class="hljs-keyword">uv_shutdown_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_write_s <span class="hljs-keyword">uv_write_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_connect_s <span class="hljs-keyword">uv_connect_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_udp_send_s <span class="hljs-keyword">uv_udp_send_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_fs_s <span class="hljs-keyword">uv_fs_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_work_s <span class="hljs-keyword">uv_work_t</span>;

<span class="hljs-comment">/* None of the above. */</span>
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_cpu_info_s <span class="hljs-keyword">uv_cpu_info_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_interface_address_s <span class="hljs-keyword">uv_interface_address_t</span>;
<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">struct</span> uv_dirent_s <span class="hljs-keyword">uv_dirent_t</span>;
</code></pre>
<p>handle&#x4EE3;&#x8868;&#x4E86;&#x6301;&#x4E45;&#x6027;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x5F02;&#x6B65;&#x7684;&#x64CD;&#x4F5C;&#x4E2D;&#xFF0C;&#x76F8;&#x5E94;&#x7684;handle&#x4E0A;&#x6709;&#x8BB8;&#x591A;&#x4E0E;&#x4E4B;&#x5173;&#x8054;&#x7684;request&#x3002;request&#x662F;&#x77ED;&#x6682;&#x6027;&#x5BF9;&#x8C61;&#xFF08;&#x901A;&#x5E38;&#x53EA;&#x7EF4;&#x6301;&#x5728;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x901A;&#x5E38;&#x5BF9;&#x6620;&#x7740;handle&#x4E0A;&#x7684;&#x4E00;&#x4E2A;I/O&#x64CD;&#x4F5C;&#x3002;request&#x7528;&#x6765;&#x5728;&#x521D;&#x59CB;&#x51FD;&#x6570;&#x548C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#xFF0C;&#x4F20;&#x9012;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x4F8B;&#x5982;uv_udp_t&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x4E2A;udp&#x7684;socket&#xFF0C;&#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x5411;socket&#x7684;&#x5199;&#x5165;&#x7684;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x90FD;&#x4F1A;&#x5411;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x4E00;&#x4E2A;<code>uv_udp_send_t</code>&#x3002;  </p>
<p>handle&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x7684;&#x51FD;&#x6570;&#x8BBE;&#x7F6E;&#xFF1A;  </p>
<pre><code class="lang-c">uv_TYPE_init(<span class="hljs-keyword">uv_loop_t</span> *, uv_TYPE_t *)
</code></pre>
<p>&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x662F;libuv&#x6240;&#x5173;&#x6CE8;&#x7684;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x540E;&#xFF0C;&#x6240;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7279;&#x5B9A;&#x903B;&#x8F91;&#x4F1A;&#x5728;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E2D;&#x5B9E;&#x73B0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;IO&#x76D1;&#x89C6;&#x5668;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4F1A;&#x63A5;&#x6536;&#x5230;&#x4ECE;&#x6587;&#x4EF6;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x4E2A;&#x5B9A;&#x65F6;&#x5668;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4F1A;&#x5728;&#x8D85;&#x65F6;&#x540E;&#x88AB;&#x89E6;&#x53D1;&#x7B49;&#x7B49;&#x3002;  </p>
<h3 id="idling">Idling</h3>
<p>&#x4E0B;&#x9762;&#x6709;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x7A7A;&#x8F6C;handle&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x4E2D;&#x90FD;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x5728;Utilities&#x8FD9;&#x90E8;&#x5206;&#x4F1A;&#x8BB2;&#x5230;&#x4E00;&#x4E9B;&#x7A7A;&#x8F6C;handle&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x3002;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7A7A;&#x8F6C;&#x76D1;&#x89C6;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x6765;&#x89C2;&#x5BDF;&#x5B83;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x63A5;&#x7740;&#x770B;<code>uv_run</code>&#x8C03;&#x7528;&#x662F;&#x5426;&#x4F1A;&#x9020;&#x6210;&#x963B;&#x585E;&#x3002;&#x5F53;&#x8FBE;&#x5230;&#x4E8B;&#x5148;&#x89C4;&#x5B9A;&#x597D;&#x7684;&#x8BA1;&#x6570;&#x540E;&#xFF0C;&#x7A7A;&#x8F6C;&#x76D1;&#x89C6;&#x5668;&#x4F1A;&#x9000;&#x51FA;&#x3002;&#x56E0;&#x4E3A;<code>uv_run</code>&#x5DF2;&#x7ECF;&#x627E;&#x4E0D;&#x5230;&#x6D3B;&#x7740;&#x7684;&#x4E8B;&#x4EF6;&#x76D1;&#x89C6;&#x5668;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;<code>uv_run()</code>&#x4E5F;&#x9000;&#x51FA;&#x3002;  </p>
<h4 id="idlebasicmainc">idle-basic/main.c</h4>
<pre><code class="lang-c"><span class="hljs-preprocessor">#<span class="hljs-keyword">include</span> <span class="hljs-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-preprocessor">#<span class="hljs-keyword">include</span> <span class="hljs-string">&lt;uv.h&gt;</span></span>

<span class="hljs-keyword">int64_t</span> counter = <span class="hljs-number">0</span>;

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">wait_for_a_while</span><span class="hljs-params">(uv_idle_t* handle)</span> </span>{
    counter++;

    <span class="hljs-keyword">if</span> (counter &gt;= <span class="hljs-number">10e6</span>)
        uv_idle_stop(handle);
}

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span> </span>{
    <span class="hljs-keyword">uv_idle_t</span> idler;

    uv_idle_init(uv_default_loop(), &amp;idler);
    uv_idle_start(&amp;idler, wait_for_a_while);

    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Idling...\n&quot;</span>);
    uv_run(uv_default_loop(), UV_RUN_DEFAULT);

    uv_loop_close(uv_default_loop());
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}
</code></pre>
<h3 id="storing-context">Storing context</h3>
<p>&#x5728;&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x9700;&#x8981;&#x5728;&#x8C03;&#x7528;&#x5904;&#x548C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#xFF0C;&#x4F20;&#x9012;&#x4E00;&#x4E9B;&#x4E0A;&#x4E0B;&#x6587;&#x7B49;&#x7279;&#x5B9A;&#x7684;&#x5E94;&#x7528;&#x4FE1;&#x606F;&#x3002;&#x6240;&#x6709;&#x7684;handle&#x548C;request&#x90FD;&#x6709;&#x4E00;&#x4E2A;<code>data</code>&#x57DF;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x4FE1;&#x606F;&#x5E76;&#x4F20;&#x9012;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;c&#x8BED;&#x8A00;&#x5E93;&#x4E2D;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x5373;&#x4F7F;&#x662F;<code>uv_loop_t</code>&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x76F8;&#x4F3C;&#x7684;<code>data</code>&#x57DF;&#x3002;      </p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="../source/introduction.html" class="navigation navigation-prev " aria-label="Previous page: 简介"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="../source/filesystem.html" class="navigation navigation-next " aria-label="Next page: 文件系统"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="../gitbook/app.js"></script>

    
    <script src="../gitbook/plugins/gitbook-plugin-github/plugin.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-github-buttons/plugin.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"github":{"url":"https://github.com/luohaha/Chinese-uvbook"},"github-buttons":{"repo":"luohaha/Chinese-uvbook","types":["star"]},"highlight":{},"search":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
